
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Асинх Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Фильтр ="Exel-файл|*.xlsx|";
	ДиалогОткрытия.Заголовок="Загрузите Exel-Файл";
	РезультатВыбора =Ждать ДиалогОткрытия.ВыбратьАсинх();
	Если (РезультатВыбора = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	Объект.Путь= РезультатВыбора[0];
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создание(Команда)
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ПоместитьФайлВоВременноеХранилище();
КонецПроцедуры

&НаКлиенте
Процедура Загрузка(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Асинх Процедура ПоместитьФайлВоВременноеХранилище()
	Описание = Ждать ПоместитьФайлНаСерверАсинх(,,,Объект.Путь,УникальныйИдентификатор);
    Если (Описание =Неопределено) Тогда
    	Возврат;
    КонецЕсли;
    ПроверкаДанныхНаСервере(Описание.Адрес);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ПроверкаДанныхНаСервере(АдресВременногоХранилища)
        ТабличныйДокумент = ПолучениеДокументаИзВременногоХранилища(АдресВременногоХранилища);
    Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗадачиКТО.Наименование
	|ИЗ
	|	Справочник.ЗадачиКТО КАК ЗадачиКТО
	|ГДЕ
	|	ЗадачиКТО.Наименование <> """"";
	Результат= Запрос.Выполнить();
    ТаблицаЗначений = Результат.Выгрузить();
        Для  Строка=1 по ТабличныйДокумент.ВысотаТаблицы Цикл
        	ИмяЗадачи= ТабличныйДокумент.Область(Строка,1).Текст;
        	//НайденаЗадача = Справочники.ЗадачиКТО.НайтиПоНаименованию(ИмяЗадачи,Истина);
        	НайденаяЗадача=ТаблицаЗначений.Найти(ИмяЗадачи,"Наименование");
        	Если Не ЗначениеЗаполнено(НайденаяЗадача) Тогда
        	 Сообщение = Новый СообщениеПользователю();
        	 Сообщение.Текст=СтрШаблон(НСтр("ru = 'Не найдена задача с названием %1'"),ИмяЗадачи);
        	 Сообщение.Сообщить();
        	КонецЕсли;
        КонецЦикла;
КонецПроцедуры
&НаСервереБезКонтекста 
Функция ПолучениеДокументаИзВременногоХранилища(АдресВременногоХранилища)
	Данные=ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Данные.Записать(ИмяВременногоФайла);
	ТабличныйДокумент= Новый ТабличныйДокумент();
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	Возврат ТабличныйДокумент;
КонецФункции
#КонецОбласти