
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Асинх Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Фильтр ="Exel-файл|*.xlsx|";
	ДиалогОткрытия.Заголовок="Загрузите Exel-Файл";
	РезультатВыбора =Ждать ДиалогОткрытия.ВыбратьАсинх();
	Если (РезультатВыбора = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	Объект.Путь= РезультатВыбора[0];
КонецПроцедуры


#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создание(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура Проверка(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Загрузка(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

